# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in this lab's data folder.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('data/Temp_States.csv', ';')
temp

         City        State  Temperature  Unnamed: 3
0         NYC     New York    19.444444         NaN
1      Albany     New York     9.444444         NaN
2     Buffalo     New York     3.333333         NaN
3    Hartford  Connecticut    17.222222         NaN
4  Bridgeport  Connecticut    14.444444         NaN
5      Treton   New Jersey    22.222222         NaN
6      Newark   New Jersey    20.000000         NaN

#### Print `temp`.

In [3]:
# your code here
print(temp)

         City        State  Temperature  Unnamed: 3
0         NYC     New York    19.444444         NaN
1      Albany     New York     9.444444         NaN
2     Buffalo     New York     3.333333         NaN
3    Hartford  Connecticut    17.222222         NaN
4  Bridgeport  Connecticut    14.444444         NaN
5      Treton   New Jersey    22.222222         NaN
6      Newark   New Jersey    20.000000         NaN

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
Unnamed: 3     float64
dtype: object

In [0]:
"""
your comments here
City and State are Objects and Temperature is Float, and we have a unnamed column with nan values only, as float
"""

#### Select the rows where state is New York.

In [5]:
# your code here
new_york = temp.loc[temp['State'] == 'New York']
new_york

      City     State  Temperature  Unnamed: 3
0      NYC  New York    19.444444         NaN
1   Albany  New York     9.444444         NaN
2  Buffalo  New York     3.333333         NaN

#### What is the average temperature of cities in New York?

In [6]:
# your code here
new_york['Temperature'].mean()

10.740740739000001

#### Which states and cities have a temperature above 15 degrees Celsius?

In [7]:
# your code here
avg_temp = temp.loc[(temp['Temperature'] > 15)]
avg_temp

       City        State  Temperature  Unnamed: 3
0       NYC     New York    19.444444         NaN
3  Hartford  Connecticut    17.222222         NaN
5    Treton   New Jersey    22.222222         NaN
6    Newark   New Jersey    20.000000         NaN

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [8]:
# your code here
avg_temp['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [9]:
# your code here
avg_temp2 = temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]
avg_temp2

       City        State  Temperature  Unnamed: 3
0       NYC     New York    19.444444         NaN
3  Hartford  Connecticut    17.222222         NaN

#### Find the mean and standard deviation of the temperature of each state.

In [10]:
# your code here
mean_temp = temp.loc[(temp['State'] == 'New York') | (temp['State'] == 'Connecticut')]
print(f"Mean is {mean_temp['Temperature'].mean()}")
print(f"Std Deviation is {mean_temp['Temperature'].std()}")

Mean is 12.7777777754
Std Deviation is 6.466914846600271

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [11]:
# your code here
employees = pd.read_csv('data/employees.csv', ';')
employees

     Name Department Education Gender      Title  Years  Salary  Unnamed: 7
0    Jose         IT  Bachelor      M    analyst      1      35         NaN
1   Maria         IT    Master      F    analyst      2      30         NaN
2   David         HR    Master      M    analyst      2      30         NaN
3   Sonia         HR  Bachelor      F    analyst      4      35         NaN
4  Samuel      Sales    Master      M  associate      3      55         NaN
5     Eva      Sales  Bachelor      F  associate      2      55         NaN
6  Carlos         IT    Master      M         VP      8      70         NaN
7   Pedro         IT       Phd      M  associate      7      60         NaN
8     Ana         HR    Master      F         VP      8      70         NaN

#### Explore the data types of the `employees` dataframe. Comment your results.

In [12]:
# your code here
employees.dtypes

Name           object
Department     object
Education      object
Gender         object
Title          object
Years           int64
Salary          int64
Unnamed: 7    float64
dtype: object

In [0]:
"""
your comments here
We have a unnamed column with only nan values. Mosto columns are objects with only two numeric
"""

#### What's the average salary in this company?

In [13]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [14]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [15]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [16]:
# your code here
low_sal = employees.sort_values(by='Salary')
low_sal.tail(10)

     Name Department Education Gender      Title  Years  Salary  Unnamed: 7
1   Maria         IT    Master      F    analyst      2      30         NaN
2   David         HR    Master      M    analyst      2      30         NaN
0    Jose         IT  Bachelor      M    analyst      1      35         NaN
3   Sonia         HR  Bachelor      F    analyst      4      35         NaN
4  Samuel      Sales    Master      M  associate      3      55         NaN
5     Eva      Sales  Bachelor      F  associate      2      55         NaN
7   Pedro         IT       Phd      M  associate      7      60         NaN
6  Carlos         IT    Master      M         VP      8      70         NaN
8     Ana         HR    Master      F         VP      8      70         NaN

#### Find all the information about an employee called David.

In [17]:
# your code here
david = employees.loc[(employees['Name'] == 'David')]
david

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
2  David         HR    Master      M  analyst      2      30         NaN

#### Could you return only David's salary?

In [18]:
# your code here
david['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [19]:
# your code here
job_title = employees.loc[(employees['Title'] == 'associate')]
job_title

     Name Department Education Gender      Title  Years  Salary  Unnamed: 7
4  Samuel      Sales    Master      M  associate      3      55         NaN
5     Eva      Sales  Bachelor      F  associate      2      55         NaN
7   Pedro         IT       Phd      M  associate      7      60         NaN

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [20]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN

In [21]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary  Unnamed: 7
0   Jose         IT  Bachelor      M  analyst      1      35         NaN
1  Maria         IT    Master      F  analyst      2      30         NaN
2  David         HR    Master      M  analyst      2      30         NaN

#### Find the employees whose title is associate and whose salary is above 55.

In [22]:
# your code here
job_plus55 = employees.loc[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]
job_plus55

    Name Department Education Gender      Title  Years  Salary  Unnamed: 7
7  Pedro         IT       Phd      M  associate      7      60         NaN

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [23]:
# your code here
num_years = employees.groupby('Years').agg({'Salary':'mean'}).reset_index()
num_years

   Years     Salary
0      1  35.000000
1      2  38.333333
2      3  55.000000
3      4  35.000000
4      7  60.000000
5      8  70.000000

####  What is the average salary per title?

In [24]:
# your code here
title_sal = employees.groupby('Title').agg({'Salary':'mean'}).reset_index()
title_sal

       Title     Salary
0         VP  70.000000
1    analyst  32.500000
2  associate  56.666667

####  Find the salary quartiles.

In [25]:
# your code here
employees['Salary'].quantile([0.25, 0.50, 0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [26]:
# your code here
gender_sal = employees.groupby('Gender').agg({'Salary':'mean'}).reset_index()
gender_sal

  Gender  Salary
0      F    47.5
1      M    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [27]:
# your code here
min_mean_max = employees.groupby('Department').agg({'Salary':['min', 'mean', 'max'],
                                                    'Years':['min', 'mean', 'max']}).reset_index()
min_mean_max

  Department Salary            Years
                min   mean max   min      mean max
0         HR     30  45.00  70     2  4.666667   8
1         IT     30  48.75  70     1  4.500000   8
2      Sales     55  55.00  55     2  2.500000   3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [0]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [0]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [0]:
# your code here

In [0]:
"""
your comments here
"""

####  What is the average purchase price?

In [0]:
# your code here

#### What are the highest and lowest purchase prices?

In [0]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [0]:
# your code here

#### How many customers do we have in Spain?

In [0]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [0]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [0]:
# your code here

#### Select all free orders.

In [0]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [0]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [0]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [0]:
# your code here

#### Select all orders made in the month of August.

In [0]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [0]:
# your code here

#### What's the  average amount of money spent by country?

In [0]:
# your code here

#### What's the most expensive item?

In [0]:
# your code here

#### What is the average amount spent per year?

In [0]:
# your code here